//=============================================================================
/// @file
/// プログラムクラス実装ファイル
///
/// プログラムクラス実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "app/program/program.h"

//=============================================================================
// インクルード実装ファイル
//-----------------------------------------------------------------------------
#include "app/program/program.hpp"

//=============================================================================
// プログラム名前空間
//-----------------------------------------------------------------------------
namespace program {
    // @cond
    //=========================================================================
    // プログラムクラス
    //-------------------------------------------------------------------------
    // 静的公開関数
    //-------------------------------------------------------------------------
    // メイン関数
    int Program::Main(HINSTANCE hInstance) noexcept {
        // 処理ブロック
        int result{0};
        do {
            // コンソールコードページ設定
            ::SetConsoleOutputCP(CP_UTF8);
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("プログラムクラス：メイン関数\n");
            // モジュール情報出力
            common::OutputModuleInfo(hInstance);
            // プログラムクラスインスタンス取得
            Program::getInstance();
        } while (false);

        // 実行結果
        return result;
    }

    //=========================================================================
    // 非公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    Program::Program() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("プログラムクラス：コンストラクタ\n");
            std::cout << std::format("ノード名：{}\n", getName());
            std::cout << std::format("JSONパス：{}\n", getJsonPointer());
        } while (false);
    }

    //-------------------------------------------------------------------------
    // デストラクタ
    Program::~Program() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("プログラムクラス：デストラクタ\n");
        } while (false);
    }
    // @encode
}
