//=============================================================================
/// @file
/// テストアプリケーションコンソールライブラリ実装ファイル
///
/// テストアプリケーションコンソールライブラリ実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "app/test/console/console.h"
#include "app/test/test.h"
#include "lib/common/config.h"
#include <iostream>
#include <fstream>

//=============================================================================
// インクルード実装ファイル
//-----------------------------------------------------------------------------
#include "common/common.hpp"
#include <nlohmann/json.hpp>

//=============================================================================
/// 無名名前空間
///
/// 無名名前空間です。
///
/// @attention なし
//-----------------------------------------------------------------------------
namespace {
    //=========================================================================
    // ファイルスコープローカル関数
    //-------------------------------------------------------------------------
    /// JSON構成情報出力関数
    ///
    /// JSON構成情報出力です。
    ///
    /// @param[in] rcJson JSONクラス参照
    /// @return    なし
    /// @attention なし
    //-------------------------------------------------------------------------
    void outJson(json& rcJson) {
        do {
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("JSON構成情報出力関数\n");
            std::cout << rcJson.dump(2) << std::endl;
            std::ofstream outFile("config.json");
            outFile << rcJson.dump(2);
        } while (false);
    }

    //-------------------------------------------------------------------------
    /// JSONテスト関数
    ///
    /// JSONテスト関数です。
    ///
    /// @param[in] rcJson JSONクラス参照
    /// @param[in] rcNode ノードクラス参照
    /// @return    なし
    /// @attention なし
    //-------------------------------------------------------------------------
    void testJson(json& rcJson, common::Node& rcNode) {
        // 処理ブロック
        do {
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("JSONテスト関数\n");
            // JSON構成情報設定
            std::string strPath{rcNode.getJsonPointer()};
            nlohmann::json::json_pointer jsonPath(strPath);
            rcJson[jsonPath] = "Hello World.";
            // JSON構成情報出力
            outJson(rcJson);
        } while (false);
    }
}

//=============================================================================
// テストアプリケーション名前空間
//-----------------------------------------------------------------------------
namespace app_test {
    //=========================================================================
    // テストアプリケーションコンソールライブラリクラス
    //=========================================================================
    // 公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    LibAppTestConsole::LibAppTestConsole(Node* pcParent) noexcept:
        // 基底クラスコンストラクタ
        LibConsole(pcParent)
    {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーションコンソールライブラリクラス：コンストラクタ\n");
            std::cout << std::format("ノード名：{}\n", getName());
            std::cout << std::format("JSONパス：{}\n", getJsonPointer());
            // モジュール情報出力
            OutputModuleInfo(nullptr);
        } while (false);
    }

    //-------------------------------------------------------------------------
    // デストラクタ
    LibAppTestConsole::~LibAppTestConsole() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーションコンソールライブラリクラス：デストラクタ\n");
        } while (false);
    }

    //=========================================================================
    // 動的公開関数
    //-------------------------------------------------------------------------
    // 初期化関数
    void LibAppTestConsole::init() noexcept
    {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーションコンソールライブラリクラス：初期化関数\n");

            // JSONテスト
            AppTest&            rcAppTest  {AppTest::getInstance()};
            LibAppTestCommon&   rcLibCommon{rcAppTest.getLibCommon()};
            lib_common::Config& rcConfig   {rcLibCommon.getConfig()};
            json&               rcJson     {rcConfig.getJson()};
            testJson(rcJson, *this);

            // コンソールライブラリクラス初期化
            LibConsole::init();
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 終了関数
    void LibAppTestConsole::finish() noexcept
    {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーションコンソールライブラリクラス：終了関数\n");
            // コンソールライブラリクラス終了
            LibConsole::finish();
        } while (false);
    }
}
