//=============================================================================
/// @file
/// 共通ライブラリヘッダファイル
///
/// 共通ライブラリヘッダファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

#pragma once

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "common/common.h"
#include "common/node.h"

//=============================================================================
// エクスポート宣言マクロ定義
//-----------------------------------------------------------------------------
#if defined(LIB_COMMON_STATIC)
#   define LIB_COMMON_API                       ///< スタティックライブラリ宣言
#elif defined(LIB_COMMON_EXPORT)
#   define LIB_COMMON_API __declspec(dllexport) ///< ダイナミックライブラリエクスポート宣言
#else
#   define LIB_COMMON_API __declspec(dllimport) ///< ダイナミックライブラリインポート宣言
#endif

//=============================================================================
/// 共通ライブラリ名前空間
///
/// 共通ライブラリ名前空間です。
///
/// @attention なし
//-----------------------------------------------------------------------------
namespace lib_common {
    //=========================================================================
    /// 共通ライブラリクラス
    ///
    /// 共通ライブラリクラスです。
    ///
    /// @attention なし
    //-------------------------------------------------------------------------
    class LIB_COMMON_API LibCommon: public common::Node {
        //=====================================================================
        // 非公開削除関数
        //---------------------------------------------------------------------
    private:
        //---------------------------------------------------------------------
        /// コピーコンストラクタ
        ///
        /// コピーコンストラクタです。
        ///
        /// @param[in] インスタンス参照
        /// @return    なし
        /// @attention この関数を削除しました。
        //---------------------------------------------------------------------
        LibCommon(LibCommon const&) = delete;

        //---------------------------------------------------------------------
        /// インスタンスコピー代入演算子オーバーロード関数
        ///
        /// インスタンスコピー代入演算子オーバーロード関数です。
        ///
        /// @param[in] インスタンス参照
        /// @return    なし
        /// @attention この関数を削除しました。
        //---------------------------------------------------------------------
        LibCommon& operator=(LibCommon const&) = delete;

        //=====================================================================
        // 限定公開構築子と解体子
        //---------------------------------------------------------------------
    protected:
        //---------------------------------------------------------------------
        /// コンストラクタ
        ///
        /// コンストラクタです。
        ///
        /// @param[in] pcParent 親ノードクラスポインタ
        /// @return    なし
        /// @attention なし
        //---------------------------------------------------------------------
        explicit LibCommon(Node* pcParent) noexcept;

        //---------------------------------------------------------------------
        /// デストラクタ
        ///
        /// デストラクタです。
        ///
        /// @param     なし
        /// @return    なし
        /// @attention なし
        //---------------------------------------------------------------------
        virtual ~LibCommon() noexcept;

        //=====================================================================
        // インライン動的公開オーバーライド関数
        //---------------------------------------------------------------------
    public:
        //---------------------------------------------------------------------
        /// ノード名取得関数
        ///
        /// ノード名取得関数です。
        ///
        /// @param     なし
        /// @return    文字列
        /// @attention なし
        //---------------------------------------------------------------------
        inline virtual std::string const getName() const noexcept override {return "LibCommon";}
    };
}
