//=============================================================================
/// @file
/// ノードクラスヘッダファイル
///
/// ノードクラスヘッダファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

#pragma once

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include <string>

//=============================================================================
/// 共通名前空間
///
/// 共通名前空間です。
///
/// @attention なし
//-----------------------------------------------------------------------------
namespace common {
    //=========================================================================
    /// ノードクラス
    ///
    /// ノードクラスです。
    ///
    /// @attention なし
    //-------------------------------------------------------------------------
    class Node {
        //=====================================================================
        // 動的限定公開変数
        //---------------------------------------------------------------------
    protected:
        Node* m_pcParent{}; ///< 親ノードクラスポインタ

        //=====================================================================
        // インライン公開構築子と解体子
        //---------------------------------------------------------------------
    public:
        //---------------------------------------------------------------------
        /// デフォルトコンストラクタ
        ///
        /// デフォルトコンストラクタです。
        ///
        /// @param     なし
        /// @return    なし
        /// @attention デフォルト定義のコンストラクタです。
        //---------------------------------------------------------------------
        inline Node() = default;

        //---------------------------------------------------------------------
        /// コンストラクタ
        ///
        /// コンストラクタです。
        ///
        /// @param[in] pcParent 親ノードクラスポインタ
        /// @return    なし
        /// @attention なし
        //---------------------------------------------------------------------
        inline explicit Node(Node* pcParent) noexcept: m_pcParent{pcParent} {}

        //---------------------------------------------------------------------
        /// デストラクタ
        ///
        /// デストラクタです。
        ///
        /// @param     なし
        /// @return    なし
        /// @attention デフォルト定義の仮想デストラクタです。
        //---------------------------------------------------------------------
        inline virtual ~Node() = default;

        //=====================================================================
        // インライン動的公開関数
        //---------------------------------------------------------------------
    public:
        //---------------------------------------------------------------------
        /// 親ノード取得関数
        ///
        /// 親ノード取得関数です。
        ///
        /// @param     なし
        /// @return    ノードクラスポインタ
        /// @attention なし
        //---------------------------------------------------------------------
        inline virtual Node* getParent() const noexcept {return this->m_pcParent;}

        //---------------------------------------------------------------------
        /// 次ノード取得関数
        ///
        /// 次ノード取得関数です。
        ///
        /// @param     なし
        /// @return    ノードクラスポインタ
        /// @attention なし
        //---------------------------------------------------------------------
        inline virtual Node* getNext() const noexcept {return nullptr;}

        //---------------------------------------------------------------------
        /// ノード名取得関数
        ///
        /// ノード名取得関数です。
        ///
        /// @param     なし
        /// @return    文字列クラス
        /// @attention なし
        //---------------------------------------------------------------------
        inline virtual std::string const getName() const noexcept {return "";}

        //---------------------------------------------------------------------
        /// JSONパス文字列取得関数
        ///
        /// JSONパス文字列取得関数です。
        ///
        /// @param     なし
        /// @return    文字列クラス
        /// @attention なし
        //---------------------------------------------------------------------
        inline virtual std::string const getJsonPointer() const noexcept {
            // 親ノードポインタ判別
            if (nullptr == m_pcParent) {
                // ノード名取得
                return "/"+getName();
            }
            
            // JSONパス文字列とノード名取得
            return m_pcParent->getJsonPointer()+"/"+getName();
        }
    };
}
