//=============================================================================
/// @file
/// テストアプリケーションコンソールライブラリヘッダファイル
///
/// テストアプリケーションコンソールライブラリヘッダファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

#pragma once

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "app/test/test.h"
#include "lib/console/console.h"

//=============================================================================
// テストアプリケーション名前空間
//-----------------------------------------------------------------------------
namespace app_test {
    //=========================================================================
    /// テストアプリケーションコンソールライブラリクラス
    ///
    /// テストアプリケーションコンソールライブラリクラスです。
    ///
    /// @attention シングルトンクラスです。
    //-------------------------------------------------------------------------
    class LibAppTestConsole final: public lib_console::LibConsole {
        //=====================================================================
        // 非公開削除関数
        //---------------------------------------------------------------------
    private:
        //---------------------------------------------------------------------
        /// コピーコンストラクタ
        ///
        /// コピーコンストラクタです。
        ///
        /// @param[in] インスタンス参照
        /// @return    なし
        /// @attention この関数を削除しました。
        //---------------------------------------------------------------------
        LibAppTestConsole(LibAppTestConsole const&) = delete;

        //---------------------------------------------------------------------
        /// インスタンスコピー代入演算子オーバーロード関数
        ///
        /// インスタンスコピー代入演算子オーバーロード関数です。
        ///
        /// @param[in] インスタンス参照
        /// @return    なし
        /// @attention この関数を削除しました。
        //---------------------------------------------------------------------
        LibAppTestConsole& operator=(LibAppTestConsole const&) = delete;

        //=====================================================================
        // 静的公開関数
        //---------------------------------------------------------------------
    public:
        //---------------------------------------------------------------------
        /// インスタンス取得関数
        ///
        /// インスタンス取得関数です。
        ///
        /// @param     なし
        /// @return    テストアプリケーションコンソールライブラリクラスインスタンス参照
        /// @attention なし
        //---------------------------------------------------------------------
        static LibAppTestConsole& GetInstance() noexcept;

        //=====================================================================
        // 非公開構築子と解体子
        //---------------------------------------------------------------------
    private:
        //---------------------------------------------------------------------
        /// コンストラクタ
        ///
        /// コンストラクタです。
        ///
        /// @param     なし
        /// @return    なし
        /// @attention なし
        //---------------------------------------------------------------------
        explicit LibAppTestConsole() noexcept;

        //---------------------------------------------------------------------
        /// デストラクタ
        ///
        /// デストラクタです。
        ///
        /// @param     なし
        /// @return    なし
        /// @attention なし
        //---------------------------------------------------------------------
        virtual ~LibAppTestConsole() noexcept;
    };
}
