//=============================================================================
/// @file
/// テストアプリケーションヘッダファイル
///
/// テストアプリケーションヘッダファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

#pragma once

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "app/test/test_def.h"
#include "app/test/common/common.h"
#include "app/test/console/console.h"
#include "app/test/window/window.h"
#include "common/node.h"

//=============================================================================
// テストアプリケーション名前空間
//-----------------------------------------------------------------------------
namespace app_test {
    //=========================================================================
    /// テストアプリケーションクラス
    ///
    /// テストアプリケーションクラスです。
    ///
    /// @attention シングルトンクラスです。
    //-------------------------------------------------------------------------
    class AppTest final: public common::Node {
        //=====================================================================
        // 公開削除関数
        //---------------------------------------------------------------------
    public:
        //---------------------------------------------------------------------
        /// コピーコンストラクタ
        ///
        /// コピーコンストラクタです。
        ///
        /// @param[in] インスタンス参照
        /// @return    なし
        /// @attention この関数を削除しました。
        //---------------------------------------------------------------------
        AppTest(AppTest const&) = delete;

        //---------------------------------------------------------------------
        /// インスタンスコピー代入演算子オーバーロード関数
        ///
        /// インスタンスコピー代入演算子オーバーロード関数です。
        ///
        /// @param[in] インスタンス参照
        /// @return    なし
        /// @attention この関数を削除しました。
        //---------------------------------------------------------------------
        AppTest& operator=(AppTest const&) = delete;

        //=====================================================================
        // 非公開構築子と解体子
        //---------------------------------------------------------------------
    // private:
        //---------------------------------------------------------------------
        /// コンストラクタ
        ///
        /// コンストラクタです。
        ///
        /// @param     なし
        /// @return    なし
        /// @attention なし
        //---------------------------------------------------------------------
        explicit AppTest() noexcept;

        //---------------------------------------------------------------------
        /// デストラクタ
        ///
        /// デストラクタです。
        ///
        /// @param     なし
        /// @return    なし
        /// @attention なし
        //---------------------------------------------------------------------
        virtual ~AppTest() noexcept;

        //=====================================================================
        // 静的公開関数
        //---------------------------------------------------------------------
    public:
        //---------------------------------------------------------------------
        /// インスタンス取得関数
        ///
        /// インスタンス取得関数です。
        ///
        /// @param     なし
        /// @return    テストアプリケーションクラスインスタンス参照
        /// @attention なし
        //---------------------------------------------------------------------
        static AppTest& getInstance() noexcept;

        //=====================================================================
        // 動的公開関数
        //---------------------------------------------------------------------
    public:
        //---------------------------------------------------------------------
        /// 初期化関数
        ///
        /// 初期化関数です。
        ///
        /// @param     なし
        /// @return    なし
        /// @attention なし
        //---------------------------------------------------------------------
        void init() noexcept;

        //---------------------------------------------------------------------
        /// 終了関数
        ///
        /// 終了関数です。
        ///
        /// @param     なし
        /// @return    なし
        /// @attention なし
        //---------------------------------------------------------------------
        void finish() noexcept;

        //=====================================================================
        // インライン公開オーバーライド関数
        //---------------------------------------------------------------------
    public:
        //---------------------------------------------------------------------
        /// ノード名取得関数
        ///
        /// ノード名取得関数です。
        ///
        /// @param     なし
        /// @return    文字列
        /// @attention なし
        //---------------------------------------------------------------------
        inline std::string const getName() const noexcept override {return "AppTest";}

        //=====================================================================
        // インライン公開関数
        //---------------------------------------------------------------------
    public:
        //---------------------------------------------------------------------
        /// テストアプリケーション共通ライブラリクラス取得関数
        ///
        /// テストアプリケーション共通ライブラリクラス取得関数です。
        ///
        /// @param     なし
        /// @return    テストアプリケーション共通ライブラリクラスインスタンス参照
        /// @attention なし
        //---------------------------------------------------------------------
        inline LibAppTestCommon& getLibCommon() noexcept {return m_cLibCommon;}

        //---------------------------------------------------------------------
        /// テストアプリケーションコンソールライブラリクラス取得関数
        ///
        /// テストアプリケーションコンソールライブラリクラス取得関数です。
        ///
        /// @param     なし
        /// @return    テストアプリケーションコンソールライブラリクラスインスタンス参照
        /// @attention なし
        //---------------------------------------------------------------------
        inline LibAppTestConsole& getLibConsole() noexcept {return m_cLibConsole;}

        //---------------------------------------------------------------------
        /// テストアプリケーションウィンドウライブラリクラス取得関数
        ///
        /// テストアプリケーションウィンドウライブラリクラス取得関数です。
        ///
        /// @param     なし
        /// @return    テストアプリケーション共通ライブラリクラスインスタンス参照
        /// @attention なし
        //---------------------------------------------------------------------
        inline LibAppTestWindow& getLibWindow() noexcept {return m_cLibWindow;}

        //=====================================================================
        // 動的非公開変数
        //---------------------------------------------------------------------
    private:
        LibAppTestCommon  m_cLibCommon {this}; ///< テストアプリケーション共通ライブラリクラスインスタンス
        LibAppTestConsole m_cLibConsole{this}; ///< テストアプリケーションコンソールライブラリクラスインスタンス
        LibAppTestWindow  m_cLibWindow {this}; ///< テストアプリケーションウィンドウライブラリクラスインスタンス
    };
}
