//=============================================================================
/// @file
/// テストアプリケーションヘッダファイル
///
/// テストアプリケーションヘッダファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

#pragma once

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "app/program/program.h"
#include "app/test/common/common.h"
#include "app/test/console/console.h"
#include "app/test/window/window.h"

//=============================================================================
// テストアプリケーション名前空間
//-----------------------------------------------------------------------------
namespace app_test {
    //=========================================================================
    /// テストアプリケーションクラス
    ///
    /// テストアプリケーションクラスです。
    ///
    /// @attention シングルトンクラスです。
    //-------------------------------------------------------------------------
    class AppTest final {
        //=====================================================================
        // 非公開削除関数
        //---------------------------------------------------------------------
    private:
        //---------------------------------------------------------------------
        /// コピーコンストラクタ
        ///
        /// コピーコンストラクタです。
        ///
        /// @param[in] インスタンス参照
        /// @return    なし
        /// @attention この関数を削除しました。
        //---------------------------------------------------------------------
        AppTest(AppTest const&) = delete;

        //---------------------------------------------------------------------
        /// インスタンスコピー代入演算子オーバーロード関数
        ///
        /// インスタンスコピー代入演算子オーバーロード関数です。
        ///
        /// @param[in] インスタンス参照
        /// @return    なし
        /// @attention この関数を削除しました。
        //---------------------------------------------------------------------
        AppTest& operator=(AppTest const&) = delete;

        //=====================================================================
        // 動的公開変数
        //---------------------------------------------------------------------
    public:
        LibAppTestCommon  m_cLibCommon {}; ///< テストアプリケーション共通ライブラリクラスインスタンス
        LibAppTestConsole m_cLibConsole{}; ///< テストアプリケーションコンソールライブラリクラスインスタンス
        LibAppTestWindow  m_cLibWindow {}; ///< テストアプリケーションウィンドウライブラリクラスインスタンス

        //=====================================================================
        // 静的公開関数
        //---------------------------------------------------------------------
    public:
        //---------------------------------------------------------------------
        /// インスタンス取得関数
        ///
        /// インスタンス取得関数です。
        ///
        /// @param     なし
        /// @return    テストアプリケーションクラスインスタンス参照
        /// @attention なし
        //---------------------------------------------------------------------
        static AppTest& GetInstance() noexcept;

        //=====================================================================
        // 非公開構築子と解体子
        //---------------------------------------------------------------------
    private:
        //---------------------------------------------------------------------
        /// コンストラクタ
        ///
        /// コンストラクタです。
        ///
        /// @param     なし
        /// @return    なし
        /// @attention なし
        //---------------------------------------------------------------------
        explicit AppTest() noexcept;

        //---------------------------------------------------------------------
        /// デストラクタ
        ///
        /// デストラクタです。
        ///
        /// @param     なし
        /// @return    なし
        /// @attention なし
        //---------------------------------------------------------------------
        virtual ~AppTest() noexcept;
    };
}
