//=============================================================================
/// @file
/// テストアプリケーションウィンドウライブラリヘッダファイル
///
/// テストアプリケーションウィンドウライブラリヘッダファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

#pragma once

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "app/test/test_def.h"
#include "lib/window/window.h"

//=============================================================================
// テストアプリケーション名前空間
//-----------------------------------------------------------------------------
namespace app_test {
    //=========================================================================
    /// テストアプリケーションウィンドウライブラリクラス
    ///
    /// テストアプリケーションウィンドウライブラリクラスです。
    ///
    /// @attention シングルトンクラスです。
    //-------------------------------------------------------------------------
    class LibAppTestWindow final: public lib_window::LibWindow {
        //=====================================================================
        // フレンド宣言
        //---------------------------------------------------------------------
        friend class AppTest; // テストアプリケーションクラス

        //=====================================================================
        // 非公開削除関数
        //---------------------------------------------------------------------
    private:
        //---------------------------------------------------------------------
        /// コピーコンストラクタ
        ///
        /// コピーコンストラクタです。
        ///
        /// @param[in] インスタンス参照
        /// @return    なし
        /// @attention この関数を削除しました。
        //---------------------------------------------------------------------
        LibAppTestWindow(LibAppTestWindow const&) = delete;

        //---------------------------------------------------------------------
        /// インスタンスコピー代入演算子オーバーロード関数
        ///
        /// インスタンスコピー代入演算子オーバーロード関数です。
        ///
        /// @param[in] インスタンス参照
        /// @return    なし
        /// @attention この関数を削除しました。
        //---------------------------------------------------------------------
        LibAppTestWindow& operator=(LibAppTestWindow const&) = delete;

        //=====================================================================
        // 非公開構築子と解体子
        //---------------------------------------------------------------------
    private:
        //---------------------------------------------------------------------
        /// コンストラクタ
        ///
        /// コンストラクタです。
        ///
        /// @param[in] pcParent 親ノードクラスポインタ
        /// @return    なし
        /// @attention なし
        //---------------------------------------------------------------------
        explicit LibAppTestWindow(Node* pcParent) noexcept;

        //---------------------------------------------------------------------
        /// デストラクタ
        ///
        /// デストラクタです。
        ///
        /// @param     なし
        /// @return    なし
        /// @attention なし
        //---------------------------------------------------------------------
        virtual ~LibAppTestWindow() noexcept;

        //=====================================================================
        // インライン動的公開オーバーライド関数
        //---------------------------------------------------------------------
    public:
        //---------------------------------------------------------------------
        /// ノード名取得関数
        ///
        /// ノード名取得関数です。
        ///
        /// @param     なし
        /// @return    文字列
        /// @attention なし
        //---------------------------------------------------------------------
        inline virtual std::string const getName() const noexcept override {return "LibAppTestWindow";}
    };
}
