//=============================================================================
/// @file
/// テストアプリケーション実装ファイル
///
/// テストアプリケーション実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "app/test/test.h"
#include "lib/common/common.h"

//=============================================================================
// インクルード実装ファイル
//-----------------------------------------------------------------------------
#include "app/program/program.hpp"

//=============================================================================
// プログラム名前空間
//-----------------------------------------------------------------------------
namespace program {
    //=========================================================================
    // プログラムクラス
    //-------------------------------------------------------------------------
    // 静的公開関数
    //-------------------------------------------------------------------------
    // メイン関数
    int Program::Main(HINSTANCE hInstance) noexcept {
        // 処理ブロック
        int result{0};
        do {
            // コンソールコードページ設定
            ::SetConsoleOutputCP(CP_UTF8);
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("プログラムクラス：メイン関数\n");
            // モジュール情報出力
            ::OutputModuleInfo(hInstance);
            // 共通ライブラリクラスインスタンス取得
            LibCommon::GetInstance();
            // テストアプリケーションクラスインスタンス取得
            AppTest::GetInstance();
        } while (false);

        // 実行結果
        return result;
    }
}

//=============================================================================
// テストアプリケーション名前空間
//-----------------------------------------------------------------------------
namespace app_test {
    //=========================================================================
    // テストアプリケーションクラス
    //=========================================================================
    // 静的公開関数
    //-------------------------------------------------------------------------
    // インスタンス取得関数
    AppTest& AppTest::GetInstance() noexcept {
        static AppTest s_cInstance; ///< テストアプリケーションクラスインスタンス
        return s_cInstance;
    }

    //=========================================================================
    // 非公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    AppTest::AppTest() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーションクラス：コンストラクタ\n");
        } while (false);
    }

    //-------------------------------------------------------------------------
    // デストラクタ
    AppTest::~AppTest() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーションクラス：デストラクタ\n");
        } while (false);
    }
}
