//=============================================================================
/// @file
/// テストアプリケーション共通ライブラリ実装ファイル
///
/// テストアプリケーション共通ライブラリ実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "app/test/common/common.h"

//=============================================================================
// インクルード実装ファイル
//-----------------------------------------------------------------------------
#include "common/common.hpp"

//=============================================================================
// テストアプリケーション名前空間
//-----------------------------------------------------------------------------
namespace app_test {
    //=========================================================================
    // テストアプリケーション共通ライブラリクラス
    //=========================================================================
    // 静的公開関数
    //-------------------------------------------------------------------------
    // インスタンス取得関数
    LibAppTestCommon& LibAppTestCommon::GetInstance() noexcept {
        static LibAppTestCommon s_cInstance; ///< テストアプリケーション共通ライブラリクラスインスタンス
        return s_cInstance;
    }

    //=========================================================================
    // 非公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    LibAppTestCommon::LibAppTestCommon() noexcept:
        // 基底クラスコンストラクタ
        LibCommon{}
    {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーション共通ライブラリクラス：コンストラクタ\n");
            // モジュール情報出力
            ::OutputModuleInfo(nullptr);
        } while (false);
    }

    //-------------------------------------------------------------------------
    // デストラクタ
    LibAppTestCommon::~LibAppTestCommon() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーション共通ライブラリクラス：デストラクタ\n");
        } while (false);
    }
}
