//=============================================================================
/// @file
/// テストアプリケーション共通ライブラリ実装ファイル
///
/// テストアプリケーション共通ライブラリ実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "app/test/common/common.h"
#include "app/test/test.h"

//=============================================================================
// インクルード実装ファイル
//-----------------------------------------------------------------------------
#include "common/common.hpp"
#include "lib/common/config.hpp"

//=============================================================================
/// 無名名前空間
///
/// 無名名前空間です。
///
/// @attention なし
//-----------------------------------------------------------------------------
namespace {
    //=========================================================================
    // ファイルスコープローカル変数
    //-------------------------------------------------------------------------
    app_test::LibAppTestCommon* s_pInstance{}; ///< テストアプリケーション共通ライブラリクラスインスタンスポインタ
}

//=============================================================================
// テストアプリケーション名前空間
//-----------------------------------------------------------------------------
namespace app_test {
    //=========================================================================
    // テストアプリケーション共通ライブラリクラス
    //=========================================================================
    // 非公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    LibAppTestCommon::LibAppTestCommon(Node* pcParent) noexcept:
        // 基底クラスコンストラクタ
        LibCommon(pcParent)
    {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーション共通ライブラリクラス：コンストラクタ\n");
            std::cout << std::format("ノード名：{}\n", getName());
            std::cout << std::format("JSONパス：{}\n", getJsonPath());
            // モジュール情報出力
            outputModuleInfo(nullptr);
        } while (false);
    }

    //-------------------------------------------------------------------------
    // デストラクタ
    LibAppTestCommon::~LibAppTestCommon() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーション共通ライブラリクラス：デストラクタ\n");
        } while (false);
    }

    //=========================================================================
    // 静的公開関数
    //-------------------------------------------------------------------------
    // インスタンス取得関数
    LibAppTestCommon& LibAppTestCommon::getInstance() noexcept {
        // 処理ブロック
        do {
            // テストアプリケーション共通ライブラリクラスインスタンスポインタチェック
            if (nullptr == s_pInstance) {
                // テストアプリケーション共通ライブラリクラスインスタンス作成
                s_pInstance = new LibAppTestCommon(nullptr);
            }
        } while (false);
        return *s_pInstance;
    }

    //-------------------------------------------------------------------------
    // インスタンス解放関数
    void LibAppTestCommon::releaseInstance() noexcept {
        // 処理ブロック
        do {
            // テストアプリケーション共通ライブラリクラスインスタンスポインタチェック
            if (nullptr != s_pInstance) {
                // テストアプリケーション共通ライブラリクラスインスタンス削除
                delete s_pInstance;
                s_pInstance = nullptr;
            }
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 初期化関数
    void LibAppTestCommon::init() noexcept
    {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーション共通ライブラリクラス：初期化関数\n");
            // JSONテスト
            // lib_common::Config::getInstance().test(*this);
            // 共通ライブラリクラス初期化
            LibCommon::init();
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 終了関数
    void LibAppTestCommon::finish() noexcept
    {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーション共通ライブラリクラス：終了関数\n");
            // 共通ライブラリクラス終了
            LibCommon::finish();
            // テストアプリケーション共通ライブラリクラスインスタンス解放
            releaseInstance();
        } while (false);
    }
}
