//=============================================================================
/// @file
/// コンソールライブラリ定義ヘッダファイル
///
/// コンソールライブラリ定義ヘッダファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

#pragma once

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "common/common.h"

//=============================================================================
// エクスポート宣言マクロ定義
//-----------------------------------------------------------------------------
#if defined(LIB_CONSOLE_STATIC)
#   define LIB_CONSOLE_API                       ///< スタティックライブラリ宣言
#elif defined(LIB_CONSOLE_EXPORT)
#   define LIB_CONSOLE_API __declspec(dllexport) ///< ダイナミックライブラリエクスポート宣言
#else
#   define LIB_CONSOLE_API __declspec(dllimport) ///< ダイナミックライブラリインポート宣言
#endif

//=============================================================================
/// コンソールライブラリ名前空間
///
/// コンソールライブラリ名前空間です。
///
/// @attention なし
//-----------------------------------------------------------------------------
namespace lib_console {}
