//=============================================================================
/// @file
/// ウィンドウライブラリ実装ファイル
///
/// ウィンドウライブラリ実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "lib/window/window.h"

//=============================================================================
// インクルード実装ファイル
//-----------------------------------------------------------------------------
#include "common/common.hpp"
#ifndef LIB_STATIC
    #include "common/node.hpp"
#endif // LIB_STATIC

//=============================================================================
/// 無名名前空間
///
/// 無名名前空間です。
///
/// @attention なし
//-----------------------------------------------------------------------------
namespace {
    //=========================================================================
    // ファイルスコープローカル変数
    //-------------------------------------------------------------------------
    HINSTANCE s_hInstance{}; ///< インスタンスハンドル
}

// エクスポート宣言チェック
#ifdef LIB_WINDOW_EXPORT

//=============================================================================
// グローバル関数
//-----------------------------------------------------------------------------
/// DLL初期化関数
///
/// DLL初期化関数です。
///
/// @param[in] hInstance  DLLモジュールハンドル
/// @param[in] dwReason   関数を呼び出す理由
/// @param[in] lpReserved 予約済み
/// @return    終了コード
/// @attention なし
//-----------------------------------------------------------------------------
BOOL WINAPI DllMain(HINSTANCE hInstance, DWORD dwReason, LPVOID lpReserved) {
    // 処理ブロック
    BOOL result{};
    do {
        // 関数呼び出し理由チェック
        if (DLL_PROCESS_ATTACH == dwReason) {
            // インスタンスハンドル取得
            s_hInstance = hInstance;
            // ウィンドウコードページ設定
            ::SetConsoleOutputCP(CP_UTF8);
            // DLL初期化関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("ウィンドウライブラリ：DLL初期化関数：アタッチ\n");
        }
        // 関数呼び出し理由チェック
        else if (DLL_PROCESS_DETACH == dwReason) {
            // DLL初期化関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("ウィンドウライブラリ：DLL初期化関数：デタッチ\n");
        }

        // 成功！
        result = true;
   } while (false);

    // 実行結果
    return result;
}

#endif // LIB_WINDOW_EXPORT

//=============================================================================
// ウィンドウライブラリ名前空間
//-----------------------------------------------------------------------------
namespace lib_window {
    //=========================================================================
    // ウィンドウライブラリクラス
    //=========================================================================
    // 限定公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    LibWindow::LibWindow(Node* pcParent) noexcept:
        // 基底クラスコンストラクタ
        Node(pcParent)
    {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("ウィンドウライブラリクラス：コンストラクタ\n");
            std::cout << std::format("ノード名：{}\n", getName());
            std::cout << std::format("JSONパス：{}\n", getJsonPath());
            // モジュール情報出力
            outputModuleInfo(s_hInstance);
        } while (false);
    }

    //-------------------------------------------------------------------------
    // デストラクタ
    LibWindow::~LibWindow() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("ウィンドウライブラリクラス：デストラクタ\n");
        } while (false);
    }

    //=========================================================================
    // 静的公開関数
    //-------------------------------------------------------------------------
    // インスタンスハンドル取得関数
    HINSTANCE LibWindow::getInstanceHandle() noexcept {
        // インスタンスハンドル取得
        return s_hInstance;
    }

    //-------------------------------------------------------------------------
    // 初期化関数
    void LibWindow::init() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("ウィンドウライブラリクラス：初期化関数\n");
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 終了関数
    void LibWindow::finish() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("ウィンドウライブラリクラス：終了関数\n");
        } while (false);
    }
}
