//=============================================================================
/// @file
/// ウィンドウライブラリヘッダファイル
///
/// ウィンドウライブラリヘッダファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

#pragma once

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "common/common.h"

//=============================================================================
// エクスポート宣言マクロ定義
//-----------------------------------------------------------------------------
#if defined(LIB_WINDOW_STATIC)
#   define LIB_WINDOW_API                       ///< スタティックライブラリ宣言
#elif defined(LIB_WINDOW_EXPORT)
#   define LIB_WINDOW_API __declspec(dllexport) ///< ダイナミックライブラリエクスポート宣言
#else
#   define LIB_WINDOW_API __declspec(dllimport) ///< ダイナミックライブラリインポート宣言
#endif

//=============================================================================
/// ウィンドウライブラリ名前空間
///
/// ウィンドウライブラリ名前空間です。
///
/// @attention なし
//-----------------------------------------------------------------------------
namespace lib_window {
    //=========================================================================
    /// ウィンドウライブラリクラス
    ///
    /// ウィンドウライブラリクラスです。
    ///
    /// @attention なし
    //-------------------------------------------------------------------------
    class LIB_WINDOW_API LibWindow: public common::Node {
        //=====================================================================
        // 非公開削除関数
        //---------------------------------------------------------------------
    private:
        //---------------------------------------------------------------------
        /// コピーコンストラクタ
        ///
        /// コピーコンストラクタです。
        ///
        /// @param[in] インスタンス参照
        /// @return    なし
        /// @attention この関数を削除しました。
        //---------------------------------------------------------------------
        LibWindow(LibWindow const&) = delete;

        //---------------------------------------------------------------------
        /// インスタンスコピー代入演算子オーバーロード関数
        ///
        /// インスタンスコピー代入演算子オーバーロード関数です。
        ///
        /// @param[in] インスタンス参照
        /// @return    なし
        /// @attention この関数を削除しました。
        //---------------------------------------------------------------------
        LibWindow& operator=(LibWindow const&) = delete;

        //=====================================================================
        // 限定公開構築子と解体子
        //---------------------------------------------------------------------
    protected:
        //---------------------------------------------------------------------
        /// コンストラクタ
        ///
        /// コンストラクタです。
        ///
        /// @param[in] pcParent 親ノードクラスポインタ
        /// @return    なし
        /// @attention なし
        //---------------------------------------------------------------------
        explicit LibWindow(Node* pcParent) noexcept;

        //---------------------------------------------------------------------
        /// デストラクタ
        ///
        /// デストラクタです。
        ///
        /// @param     なし
        /// @return    なし
        /// @attention なし
        //---------------------------------------------------------------------
        virtual ~LibWindow() noexcept;

        //=====================================================================
        // インライン動的公開オーバーライド関数
        //---------------------------------------------------------------------
    public:
        //---------------------------------------------------------------------
        /// ノード名取得関数
        ///
        /// ノード名取得関数です。
        ///
        /// @param     なし
        /// @return    文字列
        /// @attention なし
        //---------------------------------------------------------------------
        inline virtual std::string const getName() const noexcept override {return "LibWindow";}
    };
}
