//=============================================================================
/// @file
/// ウィンドウライブラリ定義ヘッダファイル
///
/// ウィンドウライブラリ定義ヘッダファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

#pragma once

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "common/common.h"

//=============================================================================
// エクスポート宣言マクロ定義
//-----------------------------------------------------------------------------
#if defined(LIB_WINDOW_STATIC)
#   define LIB_WINDOW_API                       ///< スタティックライブラリ宣言
#elif defined(LIB_WINDOW_EXPORT)
#   define LIB_WINDOW_API __declspec(dllexport) ///< ダイナミックライブラリエクスポート宣言
#else
#   define LIB_WINDOW_API __declspec(dllimport) ///< ダイナミックライブラリインポート宣言
#endif

//=============================================================================
/// ウィンドウライブラリ名前空間
///
/// ウィンドウライブラリ名前空間です。
///
/// @attention なし
//-----------------------------------------------------------------------------
namespace lib_window {}
