//=============================================================================
/// @file
/// 共通ライブラリ実装ファイル
///
/// 共通ライブラリ実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "common.h"
#include <windows.h>

// エクスポート宣言チェック
#ifdef LIB_COMMON_EXPORT

//=============================================================================
// グローバル関数
//-----------------------------------------------------------------------------
/// DLL初期化関数
///
/// DLL初期化関数です。
///
/// @param[in] hInstance  DLLモジュールハンドル
/// @param[in] dwReason   関数を呼び出す理由
/// @param[in] lpReserved 予約済み
/// @return    終了コード
/// @attention なし
//-----------------------------------------------------------------------------
BOOL WINAPI DllMain(HINSTANCE hInstance, DWORD dwReason, LPVOID lpReserved) {
    // 処理ブロック
    BOOL result{};
    do {
        // 関数呼び出し理由チェック
        if (DLL_PROCESS_ATTACH == dwReason) {
        }
        // 関数呼び出し理由チェック
        else if (DLL_PROCESS_DETACH == dwReason) {
        }

        // 成功！
        result = true;
   } while (false);

    // 実行結果
    return result;
}

#endif // LIB_COMMON_EXPORT

//=============================================================================
// 共通ライブラリ名前空間
//-----------------------------------------------------------------------------
namespace lib_common {
    //=========================================================================
    // 共通ライブラリクラス
    //=========================================================================
    // 静的公開関数
    //-------------------------------------------------------------------------
    /// インスタンス取得関数
    ///
    /// インスタンス取得関数です。
    ///
    /// @param     なし
    /// @return    共通ライブラリクラスインスタンス参照
    /// @attention なし
    //---------------------------------------------------------------------
    LibCommon& LibCommon::GetInstance() noexcept {
        static LibCommon s_cInstance; ///< 共通ライブラリクラスインスタンス
        return s_cInstance;
    }

    //=========================================================================
    // 非公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    LibCommon::LibCommon() noexcept {
    }

    //-------------------------------------------------------------------------
    // デストラクタ
    LibCommon::~LibCommon() noexcept {
    }
}
