//=============================================================================
/// @file
/// 共通ライブラリ実装ファイル
///
/// 共通ライブラリ実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "lib/common/common.h"
#include "lib/common/logout.h"

//=============================================================================
// インクルード実装ファイル
//-----------------------------------------------------------------------------
#include "common/common.hpp"
#ifndef LIB_STATIC
    #include "common/node.hpp"
#endif // LIB_STATIC
#include "lib/common/config.hpp"

//=============================================================================
/// 無名名前空間
///
/// 無名名前空間です。
///
/// @attention なし
//-----------------------------------------------------------------------------
namespace {
    //=========================================================================
    // ファイルスコープローカル変数
    //-------------------------------------------------------------------------
    HINSTANCE s_hInstance{}; ///< インスタンスハンドル
}

// エクスポート宣言チェック
#ifdef LIB_COMMON_EXPORT

//=============================================================================
// グローバル関数
//-----------------------------------------------------------------------------
/// DLL初期化関数
///
/// DLL初期化関数です。
///
/// @param[in] hInstance  DLLモジュールハンドル
/// @param[in] dwReason   関数を呼び出す理由
/// @param[in] lpReserved 予約済み
/// @return    終了コード
/// @attention なし
//-----------------------------------------------------------------------------
BOOL WINAPI DllMain(HINSTANCE hInstance, DWORD dwReason, LPVOID lpReserved) {
    // 処理ブロック
    BOOL result{};
    do {
        // 関数呼び出し理由チェック
        if (DLL_PROCESS_ATTACH == dwReason) {
            // インスタンスハンドル取得
            s_hInstance = hInstance;
            // コンソールコードページ設定
            ::SetConsoleOutputCP(CP_UTF8);
            // DLL初期化関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("共通ライブラリ：DLL初期化関数：アタッチ\n");
        }
        // 関数呼び出し理由チェック
        else if (DLL_PROCESS_DETACH == dwReason) {
            // DLL初期化関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("共通ライブラリ：DLL初期化関数：デタッチ\n");
        }

        // 成功！
        result = true;
   } while (false);

    // 実行結果
    return result;
}

#endif // LIB_COMMON_EXPORT

//=============================================================================
// 共通ライブラリ名前空間
//-----------------------------------------------------------------------------
namespace lib_common {
    //=========================================================================
    // 共通ライブラリクラス
    //=========================================================================
    // 限定公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    LibCommon::LibCommon(Node* pcParent) noexcept:
        // 基底クラスコンストラクタ
        Node(pcParent)
    {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("共通ライブラリクラス：コンストラクタ\n");
            std::cout << std::format("ノード名：{}\n", getName());
            std::cout << std::format("JSONパス：{}\n", getJsonPath());
            // モジュール情報出力
            OutputModuleInfo(s_hInstance);
            // 構成情報クラスインスタンス取得
            lib_common::Config::getInstance();
            // ログ出力クラスインスタンス取得
            lib_common::Logout::getInstance();
        } while (false);
    }

    //-------------------------------------------------------------------------
    // デストラクタ
    LibCommon::~LibCommon() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("共通ライブラリクラス：デストラクタ\n");
        } while (false);
    }

    //=========================================================================
    // 静的公開関数
    //-------------------------------------------------------------------------
    // インスタンスハンドル取得関数
    HINSTANCE LibCommon::getInstanceHandle() noexcept
    {
        // インスタンスハンドル取得
        return s_hInstance;
    }

    //=========================================================================
    // 動的公開関数
    //-------------------------------------------------------------------------
    // 初期化関数
    void LibCommon::init() noexcept
    {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("共通ライブラリクラス：初期化関数\n");
            // 構成情報クラス初期化
            Config::getInstance().init();
            // ログ出力クラス初期化
            Logout::getInstance().init(); 
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 終了関数
    void LibCommon::finish() noexcept
    {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("共通ライブラリクラス：終了関数\n");
        } while (false);
    }
}
