//=============================================================================
/// @file
/// 共通ライブラリ実装ファイル
///
/// 共通ライブラリ実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "common.h"

//=============================================================================
// インクルード実装ファイル
//-----------------------------------------------------------------------------
#include "helper.hpp"

//=============================================================================
// 無名名前空間
//-----------------------------------------------------------------------------
namespace {
    //=========================================================================
    // ファイルスコープローカル変数
    //-------------------------------------------------------------------------
    HINSTANCE s_hInstance{}; ///< インスタンスハンドル
}

// エクスポート宣言チェック
#ifdef LIB_COMMON_EXPORT

//=============================================================================
// グローバル関数
//-----------------------------------------------------------------------------
/// DLL初期化関数
///
/// DLL初期化関数です。
///
/// @param[in] hInstance  DLLモジュールハンドル
/// @param[in] dwReason   関数を呼び出す理由
/// @param[in] lpReserved 予約済み
/// @return    終了コード
/// @attention なし
//-----------------------------------------------------------------------------
BOOL WINAPI DllMain(HINSTANCE hInstance, DWORD dwReason, LPVOID lpReserved) {
    // 処理ブロック
    BOOL result{};
    do {
        // 関数呼び出し理由チェック
        if (DLL_PROCESS_ATTACH == dwReason) {
            // インスタンスハンドル取得
            s_hInstance = hInstance;
            // DLL初期化関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("共通ライブラリ：DLL初期化関数：アタッチ\n");
        }
        // 関数呼び出し理由チェック
        else if (DLL_PROCESS_DETACH == dwReason) {
            // DLL初期化関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("共通ライブラリ：DLL初期化関数：デタッチ\n");
        }

        // 成功！
        result = true;
   } while (false);

    // 実行結果
    return result;
}

#endif // LIB_COMMON_EXPORT

//=============================================================================
// 共通ライブラリ名前空間
//-----------------------------------------------------------------------------
namespace lib_common {
    //=========================================================================
    // 共通ライブラリクラス
    //=========================================================================
    // 静的公開関数
    //-------------------------------------------------------------------------
    // インスタンス取得関数
    LibCommon& LibCommon::GetInstance() noexcept {
        static LibCommon* s_pInstance = new LibCommon; ///< 共通ライブラリクラスインスタンスポインタ※デストラクタより先にデタッチが先に呼ばれるのでわざとインスタンスを残す
        return *s_pInstance;
    }

    //=========================================================================
    // 非公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    LibCommon::LibCommon() noexcept {
        // 処理ブロック
        do {
            // モジュール情報出力
            ::OutputModuleInfo(s_hInstance);
            // クラス情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("共通ライブラリクラス：コンストラクタ\n");
        } while (false);
    }
}
