//=============================================================================
/// @file
/// 構成情報クラス実装ファイル
///
/// 構成情報クラス実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "lib/common/common.h"
#include <iostream>
#include <fstream>

//=============================================================================
// インクルード実装ファイル
//-----------------------------------------------------------------------------
#include "common/common.hpp"
#include "lib/common/config.hpp"

//=============================================================================
/// 無名名前空間
///
/// 無名名前空間です。
///
/// @attention なし
//-----------------------------------------------------------------------------
namespace {
    //=========================================================================
    // ファイルスコープローカル変数
    //-------------------------------------------------------------------------
    lib_common::Config* s_pInstance{}; ///< 構成情報クラスインスタンスポインタ
    std::string         s_filename {}; ///< 構成情報ファイル名
    std::string         s_filepath {}; ///< 構成情報ファイルパス
    json*               s_pJson    {}; ///< JSONクラスインスタンスポインタ
}

//=============================================================================
// 共通ライブラリ名前空間
//-----------------------------------------------------------------------------
namespace lib_common {
    //=========================================================================
    // 構成情報クラス
    //=========================================================================
    // 非公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    Config::Config() noexcept {
        // 処理ブロック
        do {
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("構成情報クラス：コンストラクタ\n");
            // モジュール情報出力
            outputModuleInfo(lib_common::LibCommon::getInstanceHandle());
        } while (false);
    }

    //-------------------------------------------------------------------------
    // デストラクタ
    //-------------------------------------------------------------------------
    // デストラクタ
    Config::~Config() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("構成情報クラス：デストラクタ\n");
        } while (false);
    }

    //=========================================================================
    // 静的公開関数
    //-------------------------------------------------------------------------
    // インスタンス取得関数
    Config& Config::getInstance() noexcept {
        // 処理ブロック
        do {
            // 構成情報クラスインスタンスポインタチェック
            if (nullptr == s_pInstance) {
                // 構成情報クラスインスタンス作成
                s_pInstance = new Config();
            }
        } while (false);
        return *s_pInstance;
    }

    //-------------------------------------------------------------------------
    // インスタンス解放関数
    void Config::releaseInstance() noexcept {
        // 処理ブロック
        do {
            // 構成情報クラスインスタンスポインタチェック
            if (nullptr != s_pInstance) {
                // 構成情報クラスインスタンス削除
                delete s_pInstance;
                s_pInstance = nullptr;
            }
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 初期化関数
    void Config::init() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("構成情報クラス      ：初期化関数\n");
            // 構成情報ファイル名取得関数
            s_filename = "config.json";
            // 構成情報ファイルパス取得関数
            s_filepath = "./"+s_filename;
            std::cout << std::format("構成情報ファイル名  ：{}\n", s_filename);
            std::cout << std::format("構成情報ファイルパス：{}\n", s_filepath);
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 終了関数
    void Config::finish() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("構成情報クラス：終了関数\n");
            // 構成情報クラスインスタンス解放
            releaseInstance();
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 構成情報ファイル名取得関数
    std::string Config::getFilename() noexcept {
        return s_filename;
    }

    //-------------------------------------------------------------------------
    // 構成情報ファイルパス取得関数
    std::string Config::getFilePath() noexcept {
        return s_filepath;
    }

    //-------------------------------------------------------------------------
    // JSONクラスインスタンス取得関数
    json& Config::getJson() noexcept {
        // 処理ブロック
        do {
            // JSONクラスインスタンスポインタチェック
            if (nullptr == s_pJson) {
                // JSONクラスインスタンス作成
                s_pJson = new json();
            }
        } while (false);
        return *s_pJson;
    }

    //-------------------------------------------------------------------------
    // JSONクラスインスタンス解放関数
    void Config::releaseJson() noexcept {
        // 処理ブロック
        do {
            // JSONクラスインスタンスポインタチェック
            if (nullptr != s_pJson) {
                // JSONクラスインスタンス削除
                delete s_pJson;
                s_pJson = nullptr;
            }
        } while (false);
    }

    //-------------------------------------------------------------------------
    // JSONクラス取得関数
    json& Config::getJson(std::string const& path) noexcept {
        // json_pointer取得
        nlohmann::json::json_pointer ptr(path);
        return getJson()[ptr];
    }

    //-------------------------------------------------------------------------
    // JSONクラス取得関数
    json& Config::getJson(common::Node& node) noexcept {
        // json_pointer取得
        std::string path{node.getJsonPath()};
        nlohmann::json::json_pointer ptr(path);
        return getJson()[ptr];
    }

    //-------------------------------------------------------------------------
    // 構成情報ロード関数
    void Config::load() noexcept {
        // 処理ブロック
        do {
            // JSONストリームファイル入力
            std::ifstream ifs(getFilePath());
            if (ifs) {
                auto temp = nlohmann::json::parse(ifs, nullptr, false);
                if (!temp.is_discarded()) {
                    getJson() = std::move(temp);
                }
            }
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 構成情報セーブ関数
    void Config::save() noexcept {
        // 処理ブロック
        do {
            // JSONストリームファイル出力
            std::ofstream ofs(getFilePath());
            ofs << getJson().dump(2);
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 構成情報出力関数
    void Config::output() noexcept {
        // 処理ブロック
        do {
            // JSONストリーム標準出力
            std::cout << getJson().dump(2) << std::endl;
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 構成情報テスト関数
    void Config::test(common::Node& node) noexcept {
        // 処理ブロック
        do {
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("構成情報テスト関数\n");
            // 構成情報ロード
            load();
            // 構成情報設定
            std::string                  path{node.getJsonPath()+"/Test"};
            nlohmann::json::json_pointer ptr {path};
            json&                        json{getJson()};
            json[ptr] = "Hello World "+path+".";
            // 構成情報出力
            output();
            // 構成情報セーブ
            save();
        } while (false);
    }
}
