//=============================================================================
/// @file
/// 構成情報クラス実装ファイル
///
/// 構成情報クラス実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "lib/common/common.h"
#include <iostream>
#include <fstream>

//=============================================================================
// インクルード実装ファイル
//-----------------------------------------------------------------------------
#include "common/common.hpp"
#include "lib/common/config.hpp"

//=============================================================================
/// 無名名前空間
///
/// 無名名前空間です。
///
/// @attention なし
//-----------------------------------------------------------------------------
namespace {
    //=========================================================================
    // ファイルスコープローカル変数
    //-------------------------------------------------------------------------
    static std::string s_strFilename; ///< 構成情報ファイル名
    static std::string s_strFilePath; ///< 構成情報ファイルパス
}

//=============================================================================
// 共通ライブラリ名前空間
//-----------------------------------------------------------------------------
namespace lib_common {
    //=========================================================================
    // 構成情報クラス
    //=========================================================================
    // 非公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    Config::Config() noexcept {
        // 処理ブロック
        do {
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("構成情報クラス：コンストラクタ\n");
            // モジュール情報出力
            OutputModuleInfo(lib_common::LibCommon::getInstanceHandle());
        } while (false);
    }

    //-------------------------------------------------------------------------
    // デストラクタ
    //-------------------------------------------------------------------------
    // デストラクタ
    Config::~Config() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("構成情報クラス：デストラクタ\n");
        } while (false);
    }

    //=========================================================================
    // 静的公開関数
    //-------------------------------------------------------------------------
    // インスタンス取得関数
    Config& Config::getInstance() noexcept {
        static Config s_cInstance{}; ///< 構成情報クラスインスタンス
        return s_cInstance;
    }

    //=========================================================================
    // 動的公開関数
    //-------------------------------------------------------------------------
    // 初期化関数
    void Config::init() noexcept
    {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("構成情報クラス：初期化関数\n");
            // 構成情報ファイル名取得関数
            s_strFilename = "config.json";
            std::cout << std::format("構成情報ファイル名：{}\n", s_strFilename);
            // 構成情報ファイルパス取得関数
            s_strFilePath = "./"+s_strFilename;
            std::cout << std::format("構成情報ファイルパス：{}\n", s_strFilePath);
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 終了関数
    void Config::finish() noexcept
    {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("構成情報クラス：終了関数\n");
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 構成情報ファイル名取得関数
    std::string Config::getFilename() noexcept {
        return s_strFilename;
    }

    //-------------------------------------------------------------------------
    // 構成情報ファイルパス取得関数
    std::string Config::getFilePath() noexcept {
        return s_strFilePath;
    }

    //=========================================================================
    // 動的公開関数
    //-------------------------------------------------------------------------
    // JSONクラス取得関数
    json& Config::getJson() noexcept {
        static json s_cJson; ///< JSONクラスインスタンス
        return s_cJson;
    }

    //-------------------------------------------------------------------------
    // JSONクラス取得関数
    json& Config::getJson(std::string const& strPath) noexcept {
        nlohmann::json::json_pointer jsonPath(strPath);
        return getJson()[jsonPath];
    }

    //-------------------------------------------------------------------------
    // JSONクラス取得関数
    json& Config::getJson(common::Node& node) noexcept {
        std::string strPath{node.getJsonPath()};
        nlohmann::json::json_pointer jsonPath(strPath);
        return getJson()[jsonPath];
    }

    //-------------------------------------------------------------------------
    // 構成情報ロード関数
    void Config::load() noexcept {
        // JSONストリームファイル入力
        std::ifstream inFile(getFilePath());
        if (inFile) {
            auto temp = nlohmann::json::parse(inFile, nullptr, false);
            if (!temp.is_discarded()) {
                getJson() = std::move(temp);
            }
        }
    }

    //-------------------------------------------------------------------------
    // 構成情報セーブ関数
    void Config::save() noexcept {
        // JSONストリームファイル出力
        std::ofstream outFile(getFilePath());
        outFile << getJson().dump(2);
    }

    //-------------------------------------------------------------------------
    // 構成情報出力関数
    void Config::output() noexcept {
        // JSONストリーム標準出力
        std::cout << getJson().dump(2) << std::endl;
    }

    //-------------------------------------------------------------------------
    // 構成情報テスト関数
    void Config::test(common::Node& node) noexcept {
        std::cout << std::format("-------------------------------------------------------------------------------\n");
        std::cout << std::format("構成情報テスト関数\n");
        // 構成情報ロード
        load();
        // 構成情報設定
        std::string                  strPath {node.getJsonPath()+"/Test"};
        nlohmann::json::json_pointer jsonPath{strPath};
        json&                        rcJson  {getJson()};
        rcJson[jsonPath] = "Hello World "+strPath+".";
        // 構成情報出力
        output();
        // 構成情報セーブ
        save();
    }
}
