//=============================================================================
/// @file
/// ログ出力クラス実装ファイル
///
/// ログ出力クラス実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "lib/common/common.h"
#include "lib/common/logout.h"
#include <sstream>
#include <iomanip>

//=============================================================================
// インクルード実装ファイル
//-----------------------------------------------------------------------------
#include "common/common.hpp"

//=============================================================================
/// 無名名前空間
///
/// 無名名前空間です。
///
/// @attention なし
//-----------------------------------------------------------------------------
namespace {
    //=========================================================================
    // ファイルスコープローカル変数
    //-------------------------------------------------------------------------
    lib_common::Logout* s_pInstance{}; ///< ログ出力クラスインスタンスポインタ
    std::string         s_filename {}; ///< ログ出力ファイル名
    std::string         s_filepath {}; ///< ログ出力ファイルパス
}

//=============================================================================
// 共通ライブラリ名前空間
//-----------------------------------------------------------------------------
namespace lib_common {
    //=========================================================================
    // ログ出力クラス
    //=========================================================================
    // 非公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    Logout::Logout() noexcept {
        // 処理ブロック
        do {
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("ログ出力クラス：コンストラクタ\n");
            // モジュール情報出力
            outputModuleInfo(lib_common::LibCommon::getInstanceHandle());
        } while (false);
    }

    //-------------------------------------------------------------------------
    // デストラクタ
    //-------------------------------------------------------------------------
    // デストラクタ
    Logout::~Logout() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("ログ出力クラス：デストラクタ\n");
        } while (false);
    }

    //=========================================================================
    // 静的公開関数
    //-------------------------------------------------------------------------
    // インスタンス取得関数
    Logout& Logout::getInstance() noexcept {
        // 処理ブロック
        do {
            // ログ出力クラスインスタンスポインタチェック
            if (nullptr == s_pInstance) {
                // ログ出力クラスインスタンス作成
                s_pInstance = new Logout();
            }
        } while (false);
        return *s_pInstance;
    }

    //-------------------------------------------------------------------------
    // インスタンス解放関数
    void Logout::releaseInstance() noexcept {
        // 処理ブロック
        do {
            // ログ出力クラスインスタンスポインタチェック
            if (nullptr != s_pInstance) {
                // ログ出力クラスインスタンス削除
                delete s_pInstance;
                s_pInstance = nullptr;
            }
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 初期化関数
    void Logout::init() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("ログ出力クラス      ：初期化関数\n");
            // ログ出力ファイル名作成
            SYSTEMTIME st;
            GetLocalTime(&st);
            std::ostringstream oss;
            oss << std::setfill('0') << st.wYear  << std::setw(2) << st.wMonth << std::setw(2) << st.wDay << "_" << std::setw(2) << st.wHour << std::setw(2) << st.wMinute << std::setw(2) << st.wSecond;
            s_filename = oss.str()+".log";
            // ログ出力ファイルパス取得
            s_filepath = "./"+s_filename;
            std::cout << std::format("ログ出力ファイル名  ：{}\n", s_filename);
            std::cout << std::format("ログ出力ファイルパス：{}\n", s_filepath);
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 終了関数
    void Logout::finish() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("ログ出力クラス：終了関数\n");
            // ログ出力クラスインスタンス解放
            releaseInstance();
        } while (false);
    }

    //-------------------------------------------------------------------------
    // ログ出力ファイル名取得関数
    std::string Logout::getFilename() noexcept {
        return s_filename;
    }

    //-------------------------------------------------------------------------
    // ログ出力ファイルパス取得関数
    std::string Logout::getFilePath() noexcept {
        return s_filepath;
    }
}
