//=============================================================================
/// @file
/// テストアプリケーションウィンドウライブラリ実装ファイル
///
/// テストアプリケーションウィンドウライブラリ実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "app/test/window/window.h"
#include "app/test/test.h"

//=============================================================================
// インクルード実装ファイル
//-----------------------------------------------------------------------------
#include "common/common.hpp"
#include "lib/common/config.hpp"

//=============================================================================
/// 無名名前空間
///
/// 無名名前空間です。
///
/// @attention なし
//-----------------------------------------------------------------------------
namespace {
    //=========================================================================
    // ファイルスコープローカル関数
    //-------------------------------------------------------------------------
    app_test::LibAppTestWindow* s_pInstance{}; ///< テストアプリケーションウィンドウライブラリクラスインスタンスポインタ
}

//=============================================================================
// テストアプリケーション名前空間
//-----------------------------------------------------------------------------
namespace app_test {
    //=========================================================================
    // テストアプリケーションウィンドウライブラリクラス
    //=========================================================================
    // 公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    LibAppTestWindow::LibAppTestWindow(Node* pcParent) noexcept:
        // 基底クラスコンストラクタ
        LibWindow(pcParent)
    {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーションウィンドウライブラリクラス：コンストラクタ\n");
            std::cout << std::format("ノード名：{}\n", getName());
            std::cout << std::format("JSONパス：{}\n", getJsonPath());
            // モジュール情報出力
            outputModuleInfo(nullptr);
        } while (false);
    }

    //-------------------------------------------------------------------------
    // デストラクタ
    LibAppTestWindow::~LibAppTestWindow() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーションウィンドウライブラリクラス：デストラクタ\n");
        } while (false);
    }

    //=========================================================================
    // 静的公開関数
    //-------------------------------------------------------------------------
    // インスタンス取得関数
    LibAppTestWindow& LibAppTestWindow::getInstance() noexcept {
        // 処理ブロック
        do {
            // テストアプリケーションウィンドウライブラリクラスインスタンスポインタチェック
            if (nullptr == s_pInstance) {
                // テストアプリケーションウィンドウライブラリクラスインスタンス作成
                s_pInstance = new LibAppTestWindow(nullptr);
            }
        } while (false);
        return *s_pInstance;
    }

    //-------------------------------------------------------------------------
    // インスタンス解放関数
    void LibAppTestWindow::releaseInstance() noexcept {
        // 処理ブロック
        do {
            // テストアプリケーションウィンドウライブラリクラスインスタンスポインタチェック
            if (nullptr != s_pInstance) {
                // テストアプリケーションウィンドウライブラリクラスインスタンス削除
                delete s_pInstance;
                s_pInstance = nullptr;
            }
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 初期化関数
    void LibAppTestWindow::init() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーションウィンドウライブラリクラス：初期化関数\n");
            // JSONテスト
            // lib_common::Config::getInstance().test(*this);
            // ウィンドウライブラリクラス初期化
            LibWindow::init();
        } while (false);
    }

    //-------------------------------------------------------------------------
    // 終了関数
    void LibAppTestWindow::finish() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーションウィンドウライブラリクラス：終了関数\n");
            // ウィンドウライブラリクラス終了
            LibWindow::finish();
            // テストアプリケーションウィンドウライブラリクラスインスタンス解放
            releaseInstance();
        } while (false);
    }
}
