//=============================================================================
/// @file
/// テストアプリケーションウィンドウライブラリ実装ファイル
///
/// テストアプリケーションウィンドウライブラリ実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "app/test/window/window.h"

//=============================================================================
// インクルード実装ファイル
//-----------------------------------------------------------------------------
#include "common/common.hpp"

//=============================================================================
// テストアプリケーション名前空間
//-----------------------------------------------------------------------------
namespace app_test {
    //=========================================================================
    // テストアプリケーションウィンドウライブラリクラス
    //=========================================================================
    // 静的公開関数
    //-------------------------------------------------------------------------
    // インスタンス取得関数
    LibAppTestWindow& LibAppTestWindow::GetInstance() noexcept {
        static LibAppTestWindow s_cInstance; ///< テストアプリケーションウィンドウライブラリクラスインスタンス
        return s_cInstance;
    }

    //=========================================================================
    // 非公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    LibAppTestWindow::LibAppTestWindow() noexcept:
        // 基底クラスコンストラクタ
        LibWindow{}
    {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーションウィンドウライブラリクラス：コンストラクタ\n");
            // モジュール情報出力
            ::OutputModuleInfo(nullptr);
        } while (false);
    }

    //-------------------------------------------------------------------------
    // デストラクタ
    LibAppTestWindow::~LibAppTestWindow() noexcept {
        // 処理ブロック
        do {
            // 関数情報出力
            std::cout << std::format("-------------------------------------------------------------------------------\n");
            std::cout << std::format("テストアプリケーションウィンドウライブラリクラス：デストラクタ\n");
        } while (false);
    }
}
